GopalSaraf/Practicals/PSDL/include/proc/pic16c923.h
extern volatile LCDD10bits_t LCDD10bits __at(0x11A);
// bitfield macros
#define _LCDD10_SEG16_POSN                                  0x0
#define _LCDD10_SEG16_POSITION                              0x0
#define _LCDD10_SEG16_SIZE                                  0x1
#define _LCDD10_SEG16_LENGTH                                0x1
#define _LCDD10_SEG16_MASK                                  0x1
#define _LCDD10_SEG17_POSN                                  0x1
#define _LCDD10_SEG17_POSITION                              0x1
#define _LCDD10_SEG17_SIZE                                  0x1
#define _LCDD10_SEG17_LENGTH                                0x1
#define _LCDD10_SEG17_MASK                                  0x2
#define _LCDD10_SEG18_POSN                                  0x2
#define _LCDD10_SEG18_POSITION                              0x2
#define _LCDD10_SEG18_SIZE                                  0x1
#define _LCDD10_SEG18_LENGTH                                0x1
#define _LCDD10_SEG18_MASK                                  0x4
#define _LCDD10_SEG19_POSN                                  0x3
#define _LCDD10_SEG19_POSITION                              0x3
#define _LCDD10_SEG19_SIZE                                  0x1
#define _LCDD10_SEG19_LENGTH                                0x1
#define _LCDD10_SEG19_MASK                                  0x8
#define _LCDD10_SEG20_POSN                                  0x4
#define _LCDD10_SEG20_POSITION                              0x4
#define _LCDD10_SEG20_SIZE                                  0x1
#define _LCDD10_SEG20_LENGTH                                0x1
#define _LCDD10_SEG20_MASK                                  0x10
#define _LCDD10_SEG21_POSN                                  0x5
#define _LCDD10_SEG21_POSITION                              0x5
#define _LCDD10_SEG21_SIZE                                  0x1
#define _LCDD10_SEG21_LENGTH                                0x1
#define _LCDD10_SEG21_MASK                                  0x20
#define _LCDD10_SEG22_POSN                                  0x6
#define _LCDD10_SEG22_POSITION                              0x6
#define _LCDD10_SEG22_SIZE                                  0x1
#define _LCDD10_SEG22_LENGTH                                0x1
#define _LCDD10_SEG22_MASK                                  0x40
#define _LCDD10_SEG23_POSN                                  0x7
#define _LCDD10_SEG23_POSITION                              0x7
#define _LCDD10_SEG23_SIZE                                  0x1
#define _LCDD10_SEG23_LENGTH                                0x1
#define _LCDD10_SEG23_MASK                                  0x80

// Register: LCDD11
#define LCDD11 LCDD11
extern volatile unsigned char           LCDD11              __at(0x11B);
#ifndef _LIB_BUILD
asm("LCDD11 equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
        unsigned SEG26                  :1;
        unsigned SEG27                  :1;
        unsigned SEG28                  :1;
        unsigned SEG29                  :1;
        unsigned SEG30                  :1;
        unsigned SEG31                  :1;
    };
} LCDD11bits_t;
extern volatile LCDD11bits_t LCDD11bits __at(0x11B);
// bitfield macros
#define _LCDD11_SEG24_POSN                                  0x0
#define _LCDD11_SEG24_POSITION                              0x0
#define _LCDD11_SEG24_SIZE                                  0x1
#define _LCDD11_SEG24_LENGTH                                0x1
#define _LCDD11_SEG24_MASK                                  0x1
#define _LCDD11_SEG25_POSN                                  0x1
#define _LCDD11_SEG25_POSITION                              0x1
#define _LCDD11_SEG25_SIZE                                  0x1
#define _LCDD11_SEG25_LENGTH                                0x1
#define _LCDD11_SEG25_MASK                                  0x2
#define _LCDD11_SEG26_POSN                                  0x2
#define _LCDD11_SEG26_POSITION                              0x2
#define _LCDD11_SEG26_SIZE                                  0x1
#define _LCDD11_SEG26_LENGTH                                0x1
#define _LCDD11_SEG26_MASK                                  0x4
#define _LCDD11_SEG27_POSN                                  0x3
#define _LCDD11_SEG27_POSITION                              0x3
#define _LCDD11_SEG27_SIZE                                  0x1
#define _LCDD11_SEG27_LENGTH                                0x1
#define _LCDD11_SEG27_MASK                                  0x8
#define _LCDD11_SEG28_POSN                                  0x4
#define _LCDD11_SEG28_POSITION                              0x4
#define _LCDD11_SEG28_SIZE                                  0x1
#define _LCDD11_SEG28_LENGTH                                0x1
#define _LCDD11_SEG28_MASK                                  0x10
#define _LCDD11_SEG29_POSN                                  0x5
#define _LCDD11_SEG29_POSITION                              0x5
#define _LCDD11_SEG29_SIZE                                  0x1
#define _LCDD11_SEG29_LENGTH                                0x1
#define _LCDD11_SEG29_MASK                                  0x20
#define _LCDD11_SEG30_POSN                                  0x6
#define _LCDD11_SEG30_POSITION                              0x6
#define _LCDD11_SEG30_SIZE                                  0x1
#define _LCDD11_SEG30_LENGTH                                0x1
#define _LCDD11_SEG30_MASK                                  0x40
#define _LCDD11_SEG31_POSN                                  0x7
#define _LCDD11_SEG31_POSITION                              0x7
#define _LCDD11_SEG31_SIZE                                  0x1
#define _LCDD11_SEG31_LENGTH                                0x1
#define _LCDD11_SEG31_MASK                                  0x80

// Register: LCDD12
#define LCDD12 LCDD12
extern volatile unsigned char           LCDD12              __at(0x11C);
#ifndef _LIB_BUILD
asm("LCDD12 equ 011Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG00                  :1;
        unsigned SEG01                  :1;
        unsigned SEG02                  :1;
        unsigned SEG03                  :1;
        unsigned SEG04                  :1;
        unsigned SEG05                  :1;
        unsigned SEG06                  :1;
        unsigned SEG07                  :1;
    };
} LCDD12bits_t;
extern volatile LCDD12bits_t LCDD12bits __at(0x11C);
// bitfield macros
#define _LCDD12_SEG00_POSN                                  0x0
#define _LCDD12_SEG00_POSITION                              0x0
#define _LCDD12_SEG00_SIZE                                  0x1
#define _LCDD12_SEG00_LENGTH                                0x1
#define _LCDD12_SEG00_MASK                                  0x1
#define _LCDD12_SEG01_POSN                                  0x1
#define _LCDD12_SEG01_POSITION                              0x1
#define _LCDD12_SEG01_SIZE                                  0x1
#define _LCDD12_SEG01_LENGTH                                0x1
#define _LCDD12_SEG01_MASK                                  0x2
#define _LCDD12_SEG02_POSN                                  0x2
#define _LCDD12_SEG02_POSITION                              0x2
#define _LCDD12_SEG02_SIZE                                  0x1
#define _LCDD12_SEG02_LENGTH                                0x1
#define _LCDD12_SEG02_MASK                                  0x4
#define _LCDD12_SEG03_POSN                                  0x3
#define _LCDD12_SEG03_POSITION                              0x3
#define _LCDD12_SEG03_SIZE                                  0x1
#define _LCDD12_SEG03_LENGTH                                0x1
#define _LCDD12_SEG03_MASK                                  0x8
#define _LCDD12_SEG04_POSN                                  0x4
#define _LCDD12_SEG04_POSITION                              0x4
#define _LCDD12_SEG04_SIZE                                  0x1
#define _LCDD12_SEG04_LENGTH                                0x1
#define _LCDD12_SEG04_MASK                                  0x10
#define _LCDD12_SEG05_POSN                                  0x5
#define _LCDD12_SEG05_POSITION                              0x5
#define _LCDD12_SEG05_SIZE                                  0x1
#define _LCDD12_SEG05_LENGTH                                0x1
#define _LCDD12_SEG05_MASK                                  0x20
#define _LCDD12_SEG06_POSN                                  0x6
#define _LCDD12_SEG06_POSITION                              0x6
#define _LCDD12_SEG06_SIZE                                  0x1
#define _LCDD12_SEG06_LENGTH                                0x1
#define _LCDD12_SEG06_MASK                                  0x40
#define _LCDD12_SEG07_POSN                                  0x7
#define _LCDD12_SEG07_POSITION                              0x7
#define _LCDD12_SEG07_SIZE                                  0x1
#define _LCDD12_SEG07_LENGTH                                0x1
#define _LCDD12_SEG07_MASK                                  0x80

